{ "_id" : { "$oid" : "555e04e241bd99acf968dbd0" }, "title" : "Falling Down (possible Triggers)", "date" : "05/21/15 1:43 PM", "message" : "<p>Yesterday I was running errands. I was on the highway doing 70 and pass a mini-van which was doing maybe 65. I tool on down the interstate minding my own business and notice in my rear view the mini-van is approaching fast and beginning to pass. My first thoughts are \"WTF\" what's this drivers problem. (It drives me crazy when a car drives slow and then speeds up and re-passes you.)</p><p>Anyway, I glance forward. and then back in my mirrors. I see the van on my rear bumper. But I see the side of the van. I think \"Oh shit\" and then yell at the dog and say \"We are gonna die out loud\" The van is now skidding sideways and nearly tips. The van then careens toward the median, down into the median and spins then back out of the median backwards back onto the interstate and into the right side ditch end over end. I had glanced forward momentarily and though for sure it landed on it's top upside down.</p><p>I slowed and did a U-turn in the median while dialing 911 simultaneously and sped back towards the accident and performed another U-turn.</p><p>I parked. and then investigated the accident. The van was right side up and facing the opposite direction of travel. The passenger was bleeding badly. Blood was everywhere. There were a lot of lacerations to his arms and face. The driver was unresponsive but had a strong pulse. I carry a EDC bag with some trauma items mainly for my dog. I grabbed all I could find for applying pressure. Meanwhile there is luggage and all kind of shit scattered everywhere. No one bothers at all to stop. The driver becomes coherent. And now they are both screaming for help. I am doing all I can.</p><p>At than particular time something starts to snap with me. I go back to thinking about when my platoon sgt. tries to commit suicide. It feels the same. The blood, people screaming. Noise.</p><p>I am still rendering first aid. A deputy finally arrives as well a troop from in ACU's form the NG. Apparently I am white as a ghost and they thought I was in the accident too. The VFD first responders show up and begin taking over.</p><p>Everything was under control, I give a statement to the deputy and that was that. I move on my way.</p><p>Later on that afternoon I am still bothered by the event. I'm still thinking about my platoon sgt. I can't shake the images. I did nothing but walk around the neighborhood with my dog until dark. Then came home and sat in the dark the rest of the night.</p><p>Today, I have been scared to even walk out of the house and get in my truck. I have to go pick my kids up. My hands are literally shaking between pauses of typing. My hair follicles are on fire and head is throbbing. I feel as if I could break down and sob like a small child but it never happens.</p><p>I sought help from my T. Sorry, they can't get me in for a few weeks. No one else outside the VA can help much either. So...as usual I'll fight this on my own again. The wife listened a little but was too busy updating her facebook status or whatever she finds so interesting with her smartphone.</p><p>I decided to share it. Hopefully it'll help me. I understand what it is all about, but none of my tools are helping much at the moment.</p>", "type" : "", "author" : "jhillhouse", "mood" : "2", "isPublic" : true }
{ "_id" : { "$oid" :"555e24d71459617a0693162f"}, "title" : "The movie is rated ARRRRRRR", "date" : "05/21/15 4:20 PM", "message" : "I am a pirate", "type" : "", "author" : "smittywerbanmanjenson", "mood" : "2", "isPublic" : true}
